/*
;■■プロットカード■■
;■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
.chapter	涙に沈む少女
.voice  	\axx-017-02-02
.mode   	adv
.filter
.img
.bgm
;■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
;■日付け（曜日）：　１０月１７日（金）
;■時間：　放課後
;■
;■天気：　晴れ
;■場所：　教室．廊下
;■
;■登場人物（服装）：　主人公（制服）、奈々子（制服）
;■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

;――――――――――――――――――――――――――――――
;SE：チャイム
;背景：学園廊下（２Ｆ）
;――――――――――――――――――――――――――――――

.bgm bgm_001.ogg

.img0 bg_019b.img
.fade 1500
.wait 2000

好不容易等到了放学，@
我马上跑到高年级的那层楼里。

多少有点紧张啊。

由于我没有参加过什么社团活动，@
所以并没有什么前辈和后辈的意识，@
但是前辈就是前辈。

在只有前辈的地方一个人晃荡，@
多少有些怯场。

特别是现在前辈们正准备着考试，@
在忙得不可开交的这个时期……

到这里来的目的，@
还是为了柊学姐的事情。

重新仔细想了一下，
我对现实中的柊学姐一无所知。

我所知道的，
只有在大脑里面描绘出来的学姐形象@
的谣言而已。

而将这些东西和「真正的学姐」做比较的话，@
是毫无现实意义的。

当然事到如今就算知道柊学姐的有关事情，@
也不会改变些什么，@
但我想为了消除心里的疑惑也就只有这样做了。

漫步在走廊上，@
能看见几位以前认识的前辈。

亮:前辈！

.voice xx_000.ogg
前辈:哦，亮啊。@@
来这种地方干什么呀？

这个人就跟游戏中心的同伴一样，@
在校外经常碰面。

他和人相处时也不摆前辈架子，@
因此有很多关系要好的后辈。

亮:有些事情想请教一下前辈……
有关柊学姐的事情。


.voice xx_001.ogg
前辈:柊的事情啊。@@
就连在我们班里，@
这也是目前大家最关心的话题。

.voice xx_002.ogg
前辈:但是我们由于正在准备考试，@
尽可能的不想去让老师操心……

.voice xx_003.ogg
前辈:不过同年级的学生被杀，@
也不可能说不在意就能不在意的吧。

因为这位前辈并不是和柊学姐同一个班级，@
所以他知道的内容估计也只不过也是属于谣言级别而已吧。

毕竟本来柊学姐，
也不是喜欢谈论自己事情的人，@


所以一般同年级同学所听说的也都只是一些谣言，
仅此而已。

.voice xx_004.ogg
前辈:听说其实是想象中完全不同的人？@
……像这样的感觉吧。@@
反正和我不是处于同一个世界的吧。

或许因为我们学校还留有一些宗教的关系吧，@
在我们学园里面「富贵人家的大小姐」
虽然不多，但也还是有一定的人数的。

绫筱市过去也曾作为中心地区的繁荣发展，@
明治之后则开始作为纺织业城市推动经济，@
所以和农村相比这里的有钱人家自然更多一点。

如果不介意去远一点的话，@
名门院校到处都有，@
不过在本地的话还是要数我们绫筱学园。

不过就算站在这样的大小姐之中，@
柊学姐也是极其出类拔萃的。

亮:柊学姐她，
也是什么「好人家」的大小姐吗？

.voice xx_005.ogg
前辈:当然也是有钱人家的千金吧，@
不过我没有办法去确认ー。

.voice xx_006.ogg
前辈:不过据说双亲住在海外，@
好像一个人住公寓里。

居住在海外的双亲……@@
一个人独自居住……

难道说，学姐的家人，@
至今还没有把遗体领回去吗……

也没有听说要举行葬礼的意思……

总感觉这样的事情，让人看在眼里酸在心里。

.voice xx_007.ogg
前辈:啊，我还有点事情，@先走咯。

亮:谢了，@前辈。

.voice xx_008.ogg
前辈:对了，@亮。

.voice xx_009.ogg
前辈:如果想知道更多的话，@
到柊的班里，找和她经常在一起的，
那个叫做千神的女孩就可以了。

.voice xx_010.ogg
前辈:喏，就在走廊尽头的那个教室里。

亮:千神……@@学姐？

.voice xx_011.ogg
前辈:是的，@@千神　奈奈子。

前辈用手比划了一下。

写作千万的千，神灵的神「千神」吗。@@
挺罕见的名字。

.voice xx_012.ogg
前辈:只不过，@我也不晓得她现在是不是有心情听你说话……

亮:？

.voice xx_013.ogg
前辈:啊，@糟糕，@来不及了。@@
拜拜。

说着，前辈便跑开了。@@
毕业生就是和我们不一样的忙啊。

.bgm fade

按照前辈说的，我走到了走廊尽头的教室，@
看见一位从教室里走出来的前辈，
于是向其打听千神学姐的事情。

就在不远处，@@
和另一个女生说话的那个就是千神学姐。

;――――――――――――――――――――――――――――――
;BGM：悲しいその１
;――――――――――――――――――――――――――――――

.bgm bgm_011.ogg

.img1 t_nn_01.img#10

看来千神学姐应该是柊学姐的密友。

清凉的短发。@@
纤细的身材。

不过这位学姐，
那么细小的身材看上去很虚弱，@
简直如同玻璃般的纤细和脆弱。

以及那张充满悲伤的脸，@
使学姐给人以更加弱不禁风的印象。

具体在说些什么虽然我听不清楚，@
不过看起来像是和柊学姐有关。

当我走近的时候，

.voice nn_000.ogg
奈奈子:<美柚@…@…　@@@呜，@嗯呜……>

.img1 #12
千神学姐已经哭起来了。

.voice xx_014.ogg
女生:没关系吧，@奈奈子……

.voice nn_001.ogg
奈奈子:对，@对不…@@起……@@
可是@…@…@@呜……

.voice nn_003.ogg
奈奈子:美柚的……@@事情……@@
一想起来就@…@…@…　@@嗯……@@呜……

.img1

之后的那些话，@@
由于呜咽的关系已经没能说出口了。

.voice xx_015.ogg
女生:……

和千神学姐说话的女生们，
看起来都不知所措的样子，@
静静地站在那里。

而不适时出现的我，@
感觉就更加难以靠近去了……

想一下这也是理所当然的事情……

「一直都在一起」的好朋友被杀害了，@@
这不过是刚刚经过了一天的事情吧。

在这种稍微触及一下就要哭出来的状态下，@
我到底要摆出一副什么姿态，
才能让她听我的请求啊……

「一直都在一起」的好朋友……

比如……

环和柊学姐遭遇了同样的事情@
而这时候来了个仅仅是因为感兴趣想听一下的家伙……

我想我是不会放过他的吧。

现在的千神学姐，@
就处于这种状况……

……不……

还不仅如此，@
学姐正陷于比我想象中更为沉痛的悲伤之中……

亮:……

就这样我离开了高年级的楼层。

我不能在这时候如此厚颜无耻，@
向千神学姐询问，@
我也没有勇气向学姐问那样的问题……

.bgm fade
.fadeout 1500
.wait 2000

;■　伏線　■■■■■■■■■■■■■■■■■■■■■■■■■
;■
;■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
;■ＢＧＭイメージ：日常のテーマ、悲しい曲
;■必要効果音：
;■必要環境音：
;■
;■その他、画面エフェクト：
;■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

*/

#include <cstdio>
#include <cstring>
#include <algorithm>
#include <iostream>
using namespace std;

int a[100010], pos[100010];

int main()
{
    int T;
    //scanf("%d", &T);
    cin >> T;
    for (int cas = 1; cas <= T; cas++) {
        int n, p;
        //scanf("%d%d", &n, &p);
        cin >> n >> p;
        memset(pos, -1, sizeof(pos));
        pos[0] = 0;
        int sum = 0, ans = 1;
        for (int i = 1; i <= n; i++) {
            //scanf("%d", &a[i]);
            cin >> a[i];
            sum = (sum + a[i]) % p;
            if (pos[sum] == -1) pos[sum] = i;
            else ans = max(ans, i - pos[sum]);
        }
        //printf("%d\n", ans);
        cout << ans << endl;
    }
    return 0;
}
